_posts/2012-08-22-improving-peformance-of-vm-by-using-real-disk-partition.html
---
layout:     post
title:      Improving the Performance of a VM by Using a Real Disk Partition
date:       2012-08-22 9:29:00
summary:    A virtual machine can also use a real partition,
            and this can improve its performance.
---

<p>
I have used <b>zentyal</b> as a gateway server, and it is actually running
on a virtual machine. An important component of it is <b>squid</b>, which
is supposed to improve the efficiency of the network connection by
saving in cache the web pages that have been already visited, and
fetching them from the cache when they are re-visited.
</p>

<p>
This is an operation that makes intesive usage of the disk, and
virtual disks (used on virtual machines) are not particularly
efficient for it. However, a virtual machine can also use a real
partition, so the efficience of squid can be improved by attaching a
real partition to the virtual machine and using it for the cache.
</p>

<div id="outline-container-sec-1" class="outline-2">
<h2 id="sec-1">Attach a Real Partition to the Virtual Machine</h2>
<div class="outline-text-2" id="text-1">
<p>
The host where zentyal is installed is a CentOS system, and the disk partitions are managed by LVM. So, first of all we should create a new LVM partition to be attached to the virtual machine:
</p>
<pre class="example">
vgdisplay
lvdisplay
lvcreate vg_data -L 50G -n /dev/vg_data/lv_cache
</pre>

<p>
In LVM, <b>Volume Groups (VG)</b> are the equivalents of <b>disks</b>, and
<b>Logical Volumes (LV)</b> are the equivalents of <b>partitions</b>. In this
case, we are creating a <i>logical volume</i> with name
<b>/dev/vg<sub>data</sub>/lv<sub>cache</sub></b>, on the <i>volume group</i> with name
<b>vg<sub>data</sub></b>. The size of this LV partition is <b>50G</b>, and this is
enough for the squid cache.
</p>

<p>
Then we add this partition to the configuration file of the virtual
machine <code>/etc/libvirt/qemu/zentyal.xml</code>:
</p>
<pre class="example">
&lt;devices&gt;
  . . . . .
  &lt;disk type='block' device='disk'&gt;
    &lt;driver name='qemu' type='raw' cache='none' io='native'/&gt;
    &lt;source dev='/dev/vg_data/lv_cache'/&gt;
    &lt;target dev='sdb' bus='ide'/&gt;
    &lt;address type='drive' controller='0' bus='0' unit='1'/&gt;
  &lt;/disk&gt;
  . . . . .
&lt;/devices&gt;
</pre>

<p>
Inside the virtual machine this disk will appear and will be
accessed as <b>/dev/sdb</b>.
</p>

<p>
Now we have to enable it, by reloading (re-defining) the
configuration file:
</p>
<pre class="example">
virsh define /etc/libvirt/qemu/zentyal.xml
virsh shutdown zentyal
virsh start zentyal
</pre>
</div>
</div>


<div id="outline-container-sec-2" class="outline-2">
<h2 id="sec-2">Using the New Disk Inside the Virtual Machine</h2>
<div class="outline-text-2" id="text-2">
<p>
Inside the virtual machine (zentyal), we can access the new disk as
<b>/dev/sdb</b>. First we have to format and mount it, and then we can
change the <i>squid</i> configuration to use it.
</p>

<ul class="org-ul">
<li>Format the new partition with the <i>reiserfs</i> format (which is a
recommended format for the squid cache):
<pre class="example">
mkfs.reiserfs -f /dev/sdb
</pre>
</li>

<li>Append this line to <code>/etc/fstab</code>:
<pre class="example">
/dev/sdb  /var/spool/squid  reiserfs  defaults,notail,noatime  1  2
</pre>
</li>

<li>Then stop squid and mount the new partition:
<pre class="example">
service squid stop
rm -rf /var/spool/squid/*
mount -a
chown proxy:proxy /var/spool/squid/
chmod 750 /var/spool/squid/
squid -z
service squid start
</pre>
</li>

<li>Edit <code>/usr/share/zentyal/stubs/squid/squid.conf.mas</code> and change
this line:
<pre class="example">
cache_dir ufs /var/spool/squid &lt;% $cacheDirSize %&gt; 16 256
</pre>
<p>
to this one (by adding an <code>a</code> option):
</p>
<pre class="example">
cache_dir aufs /var/spool/squid &lt;% $cacheDirSize %&gt; 16 256
</pre>

<p>
Then restart:
</p>
<pre class="example">
service squid restart
</pre>
</li>
</ul>
</div>
</div>


<div id="outline-container-sec-3" class="outline-2">
<h2 id="sec-3">Referencies</h2>
<div class="outline-text-2" id="text-3">
<ul class="org-ul">
<li><a href="http://tecnologia.2020mobile.es/improving-zentyal-proxy-performance-squid-dansguardian/">http://tecnologia.2020mobile.es/improving-zentyal-proxy-performance-squid-dansguardian/</a>
</li>
<li><a href="http://www.linux-faqs.com/squid.php">http://www.linux-faqs.com/squid.php</a>
</li>
<li><a href="http://sourcelinux.wikidot.com/setting-up-squid-in-gateway-as-a-transparent-proxy">http://sourcelinux.wikidot.com/setting-up-squid-in-gateway-as-a-transparent-proxy</a>
</li>
<li><a href="http://daddy-linux.blogspot.com/2012/03/configuring-squid-proxy-server.html">http://daddy-linux.blogspot.com/2012/03/configuring-squid-proxy-server.html</a>
</li>
<li><a href="http://en.kioskea.net/faq/804-ubuntu-installing-an-http-proxy-server-squid">http://en.kioskea.net/faq/804-ubuntu-installing-an-http-proxy-server-squid</a>
</li>
<li><a href="http://doc.zentyal.org/en/proxy.html">http://doc.zentyal.org/en/proxy.html</a>
</li>
</ul>
</div>
</div>
